# Operations between DataFrame and Series

In [16]:
import pandas as pd
import numpy as np

In [17]:
index=['ottawa','clorado','boston','texas']
frame = pd.DataFrame(np.arange(12.0).reshape(4,3),columns=list('bcd'),index=index)

In [18]:
frame

           b     c     d
ottawa   0.0   1.0   2.0
clorado  3.0   4.0   5.0
boston   6.0   7.0   8.0
texas    9.0  10.0  11.0

In [19]:
series = frame.iloc[0]

In [20]:
series

b    0.0
c    1.0
d    2.0
Name: ottawa, dtype: float64

In [21]:
frame - series

           b    c    d
ottawa   0.0  0.0  0.0
clorado  3.0  3.0  3.0
boston   6.0  6.0  6.0
texas    9.0  9.0  9.0

In [22]:
series2 = pd.Series(range(3),index=['b','e','f'])

In [24]:
series2

b    0
e    1
f    2
dtype: int64

In [25]:
frame + series2

           b   c   d   e   f
ottawa   0.0 NaN NaN NaN NaN
clorado  3.0 NaN NaN NaN NaN
boston   6.0 NaN NaN NaN NaN
texas    9.0 NaN NaN NaN NaN

In [33]:
series3 = frame['d']

In [34]:
series3

ottawa      2.0
clorado     5.0
boston      8.0
texas      11.0
Name: d, dtype: float64

In [35]:
frame - series3

          b  boston   c  clorado   d  ottawa  texas
ottawa  NaN     NaN NaN      NaN NaN     NaN    NaN
clorado NaN     NaN NaN      NaN NaN     NaN    NaN
boston  NaN     NaN NaN      NaN NaN     NaN    NaN
texas   NaN     NaN NaN      NaN NaN     NaN    NaN

In [36]:
frame.sub(series3,axis='index')

           b    c    d
ottawa  -2.0 -1.0  0.0
clorado -2.0 -1.0  0.0
boston  -2.0 -1.0  0.0
texas   -2.0 -1.0  0.0

In [38]:
frame.add(series3,axis='index')

            b     c     d
ottawa    2.0   3.0   4.0
clorado   8.0   9.0  10.0
boston   14.0  15.0  16.0
texas    20.0  21.0  22.0

In [39]:
frame.div(series3,axis='index')

                b         c    d
ottawa   0.000000  0.500000  1.0
clorado  0.600000  0.800000  1.0
boston   0.750000  0.875000  1.0
texas    0.818182  0.909091  1.0

In [40]:
frame.mul(series3,axis='index')

            b      c      d
ottawa    0.0    2.0    4.0
clorado  15.0   20.0   25.0
boston   48.0   56.0   64.0
texas    99.0  110.0  121.0